014/app/Services/MunicipioService.php

SELECT `id`, `nome`
FROM `municipios`
WHERE `ufid` = '31'
---
    public function getMunicipiosByEstado($estadoId)
    {
        /*
            Retorna a lista de municípios de um estado específico.
            gerando o SQL: SELECT id, nome FROM municipios WHERE ufid = $estadoId
        */

        try {

            $municipios = $this->municipioModel->select('id, nome')->where('ufid', $estadoId)->findAll();