009/cad-alunos/app/Controllers/Home.php

    public function cadastrarAluno() {
        // obtem dados do formulário
        $nome = $this->request->getPost('nome_alu');
        $nota = $this->request->getPost('nota_alu');

        // cria um array associativo dos atributos do BD
        $aluno = [
            'noma_alu' => $nome,
            'nota_alu' => $nota
        ];

        $alunoModel = new \App\Models\AlunoModel();

        // o método save, salva ou atualiza
        if ( $alunoModel->save($aluno)) {
---
INSERT INTO `alunos` (`nota_alu`) VALUES ('1')