013/app/Services/EstadoService.php

    public function getEstados()
    {
        try {
            $estados = $this->estadoModel->orderBy('nome')->findAll();
---
SELECT *
FROM `estados`
ORDER BY `nome`